app/controllers/articles_controller.rb

SELECT `categories`.* FROM `categories`
---
  def new
    @categories = Category.all

SELECT  `categories`.* FROM `categories`  WHERE `categories`.`id` = ? LIMIT 1  [["id", 2]]
SELECT "categories".* FROM "categories"
INSERT INTO `articles` (`abstract`, `category_id`, `created_at`, `text`, `title`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["abstract", "我用于测试"], ["category_id", 2], ["created_at", "2014-08-02 06:40:56"], ["text", "<p>我用于测试我用于测试我用于测试我用于测试我用于测试我用于测试</p>\r\n"], ["title", "我用于测试"], ["updated_at", "2014-08-02 06:40:56"]]
---
  def create
    @category = Category.find(params[:article][:category])
    @categories = Category.all

    @article = @category.articles.build(article_params)
    if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["text", "Hello, world!2"], ["updated_at", "2014-06-27 00:40:41.656420"]]
---
  def update
    @article = Article.find(params[:id]);
    if @article.update(article_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:id]);
    @article.destroy