app/controllers/categories_controller.rb

  def index
    @categories = Category.where(parent: nil)
---
SELECT `categories`.* FROM `categories`  WHERE `categories`.`parent_id` IS NULL

  def create
    @parentId = params[:pid]
    if(@parentId)
      @parent = Category.find(params[:pid])
      @parent.children.create(category_param)
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "categories" ("created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-05 09:09:42.842646"], ["name", "tes"], ["parent_id", 1], ["updated_at", "2014-07-05 09:09:42.842646"]]

  def show
    @parent = Category.find(params[:id])
---
SELECT "categories".* FROM "categories"  WHERE "categories"."parent_id" = ?  [["parent_id", 1]]