app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("article_id", "body", "commentor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 2], ["body", "my world"], ["commentor", "Me"], ["created_at", "2014-06-29 00:49:54.192523"], ["updated_at", "2014-06-29 00:49:54.192523"]]
---
  def create
    @article = Article.find(params[:article_id]);
    @comment = @article.comments.create(comment_param);

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @comment = Comment.find(params[:id])
    @comment.destroy