app/controllers/pages_controller.rb

  def list
    @category_id = params[:category_id]
    @page_idx = params[:page_num].to_i
    @articleSize = Article.count
    offset = (@page_idx - 1 ) * 10
    if @category_id
      @articles =  Article.where({:category_id => @category_id}).limit(10).offset(offset);
    else
      @articles = Article.limit(10).offset(offset);
---
SELECT COUNT(*) FROM `articles`
SELECT  "articles".* FROM "articles"  WHERE "articles"."category_id" = 9 LIMIT 10 OFFSET -10
SELECT  "articles".* FROM "articles"  LIMIT 10 OFFSET 1111111111

  def set_category
    categories = Category.where(parent: nil)
---
SELECT `categories`.* FROM `categories`  WHERE `categories`.`parent_id` = ?  [["parent_id", 1]]