app/controllers/welcome_controller.rb

SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"  WHERE "categories"."parent_id" = ?  [["parent_id", 3]]
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.all
    @categories = Category.where(parent: nil)
    @articleSize = Article.count